[
    { 
        "id": "1",
        "title" : "React",
        "description": "React is a JavaScript frontend library for building user interfaces. ",

        "content": "It is maintained by Facebook and a community of individual developers and companies. You can use React to make single-page websites or mobile apps. React is a JavaScript library created by Facebook. React is a User Interface (UI) library. React is a tool for building UI components",
        "image" : "https://cdn-icons-png.flaticon.com/128/1183/1183672.png",
        "date": "2023"
    },

    {
        "id": "2",
        "title" :"NodeJs",
        "description":"Node.js is an open source server environment.",
        "content":" Node.js is free. Node.js runs on various platforms (Windows, Linux, Unix, Mac OS X, etc.). Node.js uses JavaScript on the server. Node.js can generate dynamic page content. Node.js can create, open, read, write,delete, and close files on the server. Node.js can collect form data. Node.js can add, delete, modify data in your database",
        "image" : "https://cdn-icons-png.flaticon.com/128/919/919825.png",    
        "date" :  "2009"

    },

    {
        "id": "3",
        "title" : "MangoDB",
        "description" :"MongoDB is a document database.",
        "content"  :"It stores data in a type of JSON format called BSON. If you are unfamiliar with JSON, check out our JSON tutorial. A record in MongoDB is a document, which is a data structure composed of key value pairs similar to the structure of JSON objects.",
        "image" : "https://cdn-icons-png.flaticon.com/128/9850/9850774.png",
        "date" : "2007"
    },
    {
        "id": "4",
        "title" : "HTML",
        "description" :"HTML stands for Hyper Text Markup Language",
        "content"  :"HTML is the standard markup language for creating Web pages. HTML describes the structure of a Web page. HTML consists of a series of elements. HTML elements tell the browser how to display the content.",
        "image" : "https://cdn-icons-png.flaticon.com/128/1051/1051277.png",
        "date" : "1993"
    },
    {
        "id": "5",
        "title" : "CSS",
        "description" :"CSS is the language we use to style an HTML document.",
        "content"  :"CSS stands for Cascading Style Sheets. CSS describes how HTML elements are to be displayed on screen, paper, or in other media.CSS saves a lot of work.  CSS describes how HTML elements should be displayed. This tutorial will teach you CSS from basic to advanced.",
        "image" : "https://cdn-icons-png.flaticon.com/128/732/732190.png",
        "date" : "10 October 1994"
    },
    {
        "id": "6",
        "title" : "JavaScript",
        "description" :"JavaScript is the world's most popular programming language.",
        "content"  :"JavaScript is a dynamic programming language, a scripting language used to develop web applications, games, and more. It allows us to implement dynamic features on web pages that cannot do with just HTML and CSS. Javscript are supported by all browsers.",
        "image" : "https://cdn-icons-png.flaticon.com/128/5968/5968292.png",
        "date" : "1995"
    }
]